# -*- coding: utf-8 -*-
import pandas as pd

# 데이터프레임 정의
exam_data = {'이름' : [ '서준', '우현', '인아' ],
                             '국어' : [ 90, 80, 70],
                             '영어' : [ 98, 80, 95],
                             '음악' : [ 85, 95, 100],
                             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

print(f"{'최초 출력':-^30}")
# 숫자형 인덱스로 자동 지정되어 출력됨
print(df)

print(f"{'이름을 index로 지정 후 출력':-^30}")
# 숫자형 인덱스를 '이름' 컬럼으로 변경한 후 원본에 적용
df.set_index('이름', inplace=True)
print(df)

print(f"{'0,3 요소 수정후':-^30}")
'''
0행 전체를 선택한 후 하나의 요소를 지정하는 방식이므로 성능이 떨어진다.
따라서 이와 같은 방식으로 사용하지 않기를 권고함.
'''
# df.iloc[0][3] = 77 # 경고 발생
# 컴마를 통해 하나의 요소를 직접 지정하는 방식을 권장한다.
df.iloc[0, 3] = 77
print(df)

print(f"{'서준, 체육 요소 수정후':-^30}")
# 문자형 인덱스로 접근하더라도 동일한 경고가 발생된다.
# df.loc['서준']['체육'] = 66 # 경고 발생
df.loc['서준', '체육'] = 66
print(df)

print(f"{'우현 수정후':-^30}")
# 2개 이상의 요소를 동일한 값으로 수정
df.loc['우현', ['영어', '체육']] = 55
print(df)
print(f"{'인아 수정후':-^30}")
# 여러 요소를 서로 다른 값으로 수정
df.loc['인아', ['국어', '음악']] = 44, 33
print(df)

print(f"{'체육을 index로 수정':-^30}")
'''
체육 컬럼을 새로운 인덱스로 지정한다. 그러면 기존에 지정된 이름은
삭제되고, 체육으로 인덱스가 대체된다.
'''
new_df1 = df.set_index('체육')
print(new_df1)  
print('66, 국어 => ', new_df1.loc[66, '국어'])

print(f"{'음악과 영어를 index로 수정':-^30}")
# 2개의 컬럼을 인덱스로 지정한다.
new_df2 = new_df1.set_index(['음악', '영어'])
# 컬럼에서는 국어만 남게된다.
print(new_df2)
# 인덱스가 2개이므로 요소를 지정할때도 아래와 같이 작성한다.
print('(85,98), 국어 => ', new_df2.loc[(85,98), '국어'])
print('(33,95), 국어 => ', new_df2.loc[(33,95), '국어'])
